# 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
iter_obj = [ 2, 5, 100]
print((sum(iter_obj))-(min(iter_obj)))




